//null safety
//1_هي تعتبر حماية من القيم الغارغة عندما تعرف متغير ولا يتم اسناد قيمة له
//يقوم بحجز مكان في الذاكرة لكن يبقى فارغ لذالك يتم التنبية ليتم اسناد قيمة له
//عندما تقوم بتعريف متغير يتم انشائة non-nullably بشكل مباشر نستطيع تحويلة الى null
//2_اذا اردنا تحويل الى nullably نظيف بعظ تعريف نوعه علامة ؟ مثل ?int او ?string
// او عندما تستخدم المتغير الذي قمنا بتعريفة في اي عملية انة null نضع بجانبة علامة ! مثل 
// num1! * num2; 
// لكن نكون متاكدين ان قيمة المتغير ستاتي قبل الوصول الى سطر العليمة المرادة
//3_ او اذا اردنا ان نسند قيمة متغير هو null الى متغير اخر لكن هذا المتغير 
// بقي كما هو null نعطية قيمة افتراضية بهذا الشكل 
// result =num1 ?? 15;
//4_ اذا اردنا تحويل من نوع الى نوع للمتغيرات مع العلم ان المتغير سايخذ قيمتة
// قبل الوصول الى العملية المراد الوصول لها نكتب التحويلة بهذا الشكل 
//a_ نعرف متغير 
//int? num1;
//b_ نغير النوع الى نوع اخر باستخدام ؟ بعد المتغير ثم النوع المراد تغييره
// num2?.toDouble;
//العملية بشكل كامل تعني ان المتغير اذا بقي كما هو null لا تنفذ ما بعد ال ؟

void main(){
  //اول حالة حولنا المتغير من non-nullably الى null باضافة ؟ بعد النوع
  int? num1;
  int num2=11;
  print(num1);
  int result;

  // الحالة الثانية عند القيام باستخدام المتغير في عملية اين كانت
  // سيضهر خطى لاننا استخدمنا المتغير وهو null لذالك نستخدم بعد كتابة
  // اسم المتغير علامة ! لنجعل النظام يتاكد ان المتغير سيتم اسناد 
  //قيمة له قبل الوصول الى العملية 
  //result =num1! + num2;

  // هي هذه الحالة اسندنا قيمة متغير هو null الى متغير اخر لكن في حال
  // ما زال المتغير null نسند قيمة افتارضة للمتغير 
  // باستخدام ؟؟ بعد المتغير وبعدها القيمة التي تسند لة
  result =num1 ?? 10;

  // تحويل الانواع للمتغيرات ال null يتم ك الاتي 
  //نذكر اسم المتغير المراد تغييرة ومن ثم علامة ؟ بعد المتغير ومن ثم . ومن ثم 
  // نوع المتغير المراد تحويلة مثل 
  // num2?.toDouble;
  num1?.toDouble();
}